Revit 2027 API
IFCAggregate.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<IFCData> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of IFCData)
public:
virtual IEnumerator<IFCData^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<IFCData>
override GetEnumerator : unit -> IEnumerator<IFCData>
Return Value
IEnumerator<IFCData>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace